{"format":"layers-model","generatedBy":"keras v3.13.2","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.13.2","backend":"tensorflow","training_config":{"loss":"sparse_categorical_crossentropy","loss_weights":null,"metrics":["accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":true,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":3.12499992105586e-06,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}},"class_name":"Functional","config":{"name":"mnist_cnn","trainable":true,"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"name":"input_layer_1","batchInputShape":[null,28,28]},"name":"input_layer_1","inbound_nodes":[]},{"class_name":"Reshape","config":{"name":"reshape","trainable":true,"dtype":"float32","targetShape":[28,28,1]},"name":"reshape","inbound_nodes":[[["input_layer_1",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"conv2d","trainable":true,"dtype":"float32","filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conv2d","inbound_nodes":[[["reshape",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"batch_normalization","trainable":true,"dtype":"float32","axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"name":"batch_normalization","inbound_nodes":[[["conv2d",0,0,{}]]]},{"class_name":"Activation","config":{"name":"activation","trainable":true,"dtype":"float32","activation":"relu"},"name":"activation","inbound_nodes":[[["batch_normalization",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"conv2d_1","trainable":true,"dtype":"float32","filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conv2d_1","inbound_nodes":[[["activation",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_1","trainable":true,"dtype":"float32","axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"name":"batch_normalization_1","inbound_nodes":[[["conv2d_1",0,0,{}]]]},{"class_name":"Activation","config":{"name":"activation_1","trainable":true,"dtype":"float32","activation":"relu"},"name":"activation_1","inbound_nodes":[[["batch_normalization_1",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"max_pooling2d","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"},"name":"max_pooling2d","inbound_nodes":[[["activation_1",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.25},"name":"dropout","inbound_nodes":[[["max_pooling2d",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"conv2d_2","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conv2d_2","inbound_nodes":[[["dropout",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_2","trainable":true,"dtype":"float32","axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"name":"batch_normalization_2","inbound_nodes":[[["conv2d_2",0,0,{}]]]},{"class_name":"Activation","config":{"name":"activation_2","trainable":true,"dtype":"float32","activation":"relu"},"name":"activation_2","inbound_nodes":[[["batch_normalization_2",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"conv2d_3","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conv2d_3","inbound_nodes":[[["activation_2",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_3","trainable":true,"dtype":"float32","axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"name":"batch_normalization_3","inbound_nodes":[[["conv2d_3",0,0,{}]]]},{"class_name":"Activation","config":{"name":"activation_3","trainable":true,"dtype":"float32","activation":"relu"},"name":"activation_3","inbound_nodes":[[["batch_normalization_3",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"max_pooling2d_1","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"},"name":"max_pooling2d_1","inbound_nodes":[[["activation_3",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":"float32","rate":0.25},"name":"dropout_1","inbound_nodes":[[["max_pooling2d_1",0,0,{}]]]},{"class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":"float32","data_format":"channels_last"},"name":"flatten","inbound_nodes":[[["dropout_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":256,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["flatten",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_4","trainable":true,"dtype":"float32","axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"name":"batch_normalization_4","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Activation","config":{"name":"activation_4","trainable":true,"dtype":"float32","activation":"relu"},"name":"activation_4","inbound_nodes":[[["batch_normalization_4",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":"float32","rate":0.5},"name":"dropout_2","inbound_nodes":[[["activation_4",0,0,{}]]]},{"class_name":"Dense","config":{"name":"output","trainable":true,"dtype":"float32","units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"output","inbound_nodes":[[["dropout_2",0,0,{}]]]}],"input_layers":[["input_layer_1",0,0]],"output_layers":[["output",0,0]]}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"batch_normalization/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization/beta","shape":[32],"dtype":"float32"},{"name":"batch_normalization/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_1/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_1/beta","shape":[32],"dtype":"float32"},{"name":"batch_normalization_1/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_1/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_2/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_2/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_2/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_2/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_3/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_3/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_3/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_3/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_4/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_4/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_4/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_4/moving_variance","shape":[256],"dtype":"float32"},{"name":"conv2d/kernel","shape":[3,3,1,32],"dtype":"float32"},{"name":"conv2d_1/kernel","shape":[3,3,32,32],"dtype":"float32"},{"name":"conv2d_2/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"conv2d_3/kernel","shape":[3,3,64,64],"dtype":"float32"},{"name":"dense/kernel","shape":[3136,256],"dtype":"float32"},{"name":"output/kernel","shape":[256,10],"dtype":"float32"},{"name":"output/bias","shape":[10],"dtype":"float32"}]}]}